Merge pull request #32 from revenantonthemission/main
PR: JWT 도입 & 코드 품질 개선
